Show / Hide Table of Contents
Class ConcreteULSCheckResultInteractionEc2
ULS Check Interaction Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteULSCheckResultInteraction
ConcreteULSCheckResultInteractionEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteULSCheckResultInteractionEc2 : ConcreteULSCheckResultInteraction
Properties
Improve this Doc   View Source
CheckValueShearAndTorsion
Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
Declaration
public double CheckValueShearAndTorsion { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CheckValueShearTorsionAndBending
Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value
Declaration
public double CheckValueShearTorsionAndBending { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Medy
Design value of the applied bending moment around y axis
Declaration
public double Medy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Medz
Design value of the applied bending moment around z axis
Declaration
public double Medz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ned
Design value of the applied axial force
Declaration
public double Ned { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ted
Design value of the applied torsional moment
Declaration
public double Ted { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ved
Design value of the applied shear force
Declaration
public double Ved { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source